<font face="courier new,courier" size="3"><strong>Primer Proyecto (10%)</strong><br /><br />El objetivo del proyecto es implementar un sistema cliente-servidor con un<br />protocolo que permita colocarle a la computadora donde se ejecuta el cliente<br />la hora que tiene la computadora donde se ejecuta el servidor.<br /><br />Se debe implementar empleando los protocolos UDP y TCP.<br /><br />La operaci&oacute;n b&aacute;sica consiste en que el cliente debe preguntar varias<br />veces la hora al servidor, y hallar un &quot;promedio&quot; utilizando el<br />algoritmo de Marzullo (explicado en<br />http://en.wikipedia.org/wiki/Marzullo's_algorithm). <br /><br />La sintaxis de la aplicaci&oacute;n cliente es:<br /><br /><strong>c_tiempo -s &lt;servidor&gt; -p &lt;puerto&gt; -v &lt;numero de preguntas&gt; {-t|-u} [-n]</strong><br /><br />donde:<br /><br />&nbsp;-s &lt;servidor&gt; Indica la direcci&oacute;n IP o nombre de host del servidor con el <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; cual se desea sincronizar, donde debe estar ejecut&aacute;ndose la<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; aplicaci&oacute;n servidor.<br /><br />&nbsp;-p &lt;puerto&gt; Indica el puerto a trav&eacute;s del cual se debe contactar a la aplicaci&oacute;n<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; servidor.<br /><br />&nbsp;-v &lt;numero de preguntas&gt; Indica el numero de veces que el cliente preguntar&aacute;<br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; la hora al servidor.<br /><br />&nbsp;-t Indica que se desea utilizar el protocolo TCP. La aplicaci&oacute;n servidor debe<br />&nbsp;&nbsp;&nbsp; estar ejecut&aacute;ndose empleando el mismo protocolo.<br /><br />&nbsp;-u Indica que se desea utilizar el protocolo UDP. La aplicaci&oacute;n servidor debe<br />&nbsp;&nbsp;&nbsp; estar ejecut&aacute;ndose empleando el mismo protocolo.<br /><br />&nbsp;-n Indica que la hora obtenida debe mostrarse por la salida est&aacute;ndar, en lugar<br />&nbsp;&nbsp;&nbsp; de tratar de establecerla como hora del sistema (&uacute;til si no se tienen privilegios<br />&nbsp;&nbsp;&nbsp; de administraci&oacute;n).<br /><br />La sintaxis de la aplicaci&oacute;n servidor es:<br /><br /><strong>s_tiempo -p &lt;puerto&gt; {-t|-u}</strong><br /><br />&nbsp;-p &lt;puerto&gt; Indica el puerto a trav&eacute;s del cual se aceptar&aacute;n peticiones de <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; la aplicaci&oacute;n cliente.<br /><br />&nbsp;-t Indica que se desea utilizar el protocolo TCP. Se contestar&aacute;n peticiones de<br />&nbsp;&nbsp;&nbsp; la aplicaci&oacute;n cliente utilizando TCP.<br /><br />&nbsp;-u Indica que se desea utilizar el protocolo UDP. Se contestar&aacute;n peticiones de<br />&nbsp;&nbsp;&nbsp; la aplicaci&oacute;n cliente utilizando TCP.<br /><br />Observe que todos los par&aacute;metros son obligatorios excepto &quot;-n&quot;, y las<br />opciones &quot;-t&quot; y &quot;-u&quot; son mutuamente excluyentes. Se recomienda<br />utilizar los &uacute;ltimos 5 d&iacute;gitos del n&uacute;mero de carnet de uno de los<br />integrantes de cada equipo como n&uacute;mero de puerto, para evitar<br />conflictos con otros equipos.<br /><br />Si se emplea el protocolo UDP, la aplicaci&oacute;n cliente debe preguntar<br />por la hora a la aplicaci&oacute;n servidor el n&uacute;mero de veces especificado<br />en la linea de comandos, utilizando un (1) paquete UDP en cada<br />oportunidad. En el caso en que para una pregunta no se obtenga<br />respuesta (no llega el paquete de respuesta), el cliente debe ignorar<br />esa pregunta y continuar con la siguiente.<br /><br />Si se emplea el protocolo TCP, la aplicaci&oacute;n cliente debe abrir una<br />conexi&oacute;n, enviar un mensaje y esperar una respuesta por la misma<br />conexi&oacute;n. Se debe mantener una &uacute;nica conexi&oacute;n independientemente del<br />numero de preguntas especificadas en la linea de comandos.<br /><br />Cualquiera que sea el m&eacute;todo seleccionado por el cliente, al finalizar<br />la ejecuci&oacute;n del programa cliente el computador local debe mostrar la<br />hora obtenida y establecerla como hora del sistema donde se ejecuta,<br />exceptuando el caso en que haya sido invocado con la opci&oacute;n &quot;-n&quot;.<br />Adicionalmente, debe dar algunas estad&iacute;sticas como salida, en<br />particular, tama&ntilde;o promedio del intervalo entre la realizaci&oacute;n de la<br />pregunta y la obtenci&oacute;n de la respuesta y, en el caso de UDP, indicar<br />cuantas preguntas hubo cuyas respuestas no se recibieron.<br /><br />El nivel de granularidad de la sincronizaci&oacute;n debe ser al menos de<br />segundos.<br /><br />Para esta primera entrega, no se requiere que el servidor pueda<br />atender simult&aacute;neamente varias solicitudes.<br /><br />La implementaci&oacute;n debe realizarse usando la librer&iacute;a est&aacute;ndar de<br />sockets en C, y debe compilar y ejecutarse sin problemas en cualquier<br />estaci&oacute;n de trabajo del LDC. La implementaci&oacute;n debe manejar<br />adecuadamente situaciones excepcionales (errores) en las llamadas al<br />sistema. Deben seguirse los principios de modularidad, estilo y<br />documentaci&oacute;n (comentarios) en el c&oacute;digo fuente implementado.<br /><br />El proyecto deber&aacute; entregarse por aula virtual, subiendo un archivo<br />tar.gz cuyo nombre sea p1-g&lt;GRUPO&gt;.tar.gz en el area de documentos de<br />grupo.&nbsp; Dentro del archivo debe existir un directorio llamado de la<br />misma forma con los fuentes y un archivo Makefile que permita compilar<br />el proyecto (tanto cliente como servidor) ejecutando simplemente el<br />comando make (por ejemplo, si es el grupo 10, el archivo deber&aacute;<br />llamarse p1-g10.tar.gz y contener un &uacute;nico directorio llamado p1-g10<br />dentro del cual se encuentre el c&oacute;digo fuente y el archivo<br />makefile). Los proyectos que no cumplan con estas reglas tendr&aacute;n<br />penalizaci&oacute;n en la nota final. Adicionalmente se debe entregar un<br />archivo PDF de 3 p&aacute;ginas m&aacute;ximo que contenga un manual de uso, el<br />dise&ntilde;o b&aacute;sico de la herramienta y dos diagramas de secuencia que<br />muestren la interacci&oacute;n entre cliente y servidor en ambos protocolos<br />(TCP y UDP).<br /><br />El proyecto debe entregarse antes del dia 06/02/2009 a las 11:59pm a<br />trav&eacute;s de aula virtual.</font>